---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.PartNotIncludedInMerge
source: html/193d1cbe-ff5f-3934-d4be-6115697539ba.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PartMakerMethodForMergePartFailures.PartNotIncludedInMerge Property

This part is not geometrically coincident with another part of the same material. No merge possible.

## Syntax (C#)
```csharp
public static FailureDefinitionId PartNotIncludedInMerge { get; }
```